# DS-SF-36 | 04 | Databases and Scrapping | Codealong | Starter Code

## Part A | RDBMS Databases and `SQLite`

In [42]:
import os

import pandas as pd
pd.set_option('display.max_rows', 20)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

import sqlite3

> ### How to connect to a `SQLite` database

In [9]:
db = sqlite3.connect(os.path.join('..', 'datasets', 'dataset-04-zillow.db'))

In [3]:
#
a = "This is a " +\
    "string"

In [4]:
#
a = ("This is a " +
    "string")

In [7]:
a =  '''
This is one line.
This is another
'''

In [8]:
a

'\nThis is one line.\nThis is another\n'

> ### How to use `pandas` to run SQL queries and get the results as a `DataFrame`

In [68]:
thing1 = pd.io.sql.read_sql(
'''
SELECT *                  ---* means everything    
    FROM properties       --- from a table, properties is a table 
    ---LIMIT 10              --- limit the size of data it shows
;
''', con = db)          # con means the connection

In [28]:
type(thing)          # means it's a dataframe

pandas.core.frame.DataFrame

In [29]:
thing.head(5)

,id,address,latitude,longitude,is_a_studio,...,size,size_unit,lot_size,lot_size_unit,built_in_year
0,2121978635,"829 Folsom St UNIT 906, San Francisco, CA",37781429,-122401860,0,...,557.0,sqft,NaN,None,2010.0
1,89239580,"690 Market St UNIT 1705, San Francisco, CA",37788246,-122403198,0,...,1050.0,sqft,NaN,None,2007.0
2,15131782,"401 Grand View Ave APT 3, San Francisco, CA",37752157,-122442356,0,...,937.0,sqft,NaN,None,1983.0
3,15179502,"250 Concord St, San Francisco, CA",37710141,-122442063,0,...,1574.0,sqft,1947.0,sqft,1959.0
4,52266124,"88 King St APT 317, San Francisco, CA",37780630,-122389635,0,...,1205.0,sqft,NaN,None,2000.0

In [30]:
thing.columns

Index(['id', 'address', 'latitude', 'longitude', 'is_a_studio', 'beds',
       'baths', 'size', 'size_unit', 'lot_size', 'lot_size_unit',
       'built_in_year'],
      dtype='object')

In [13]:
thing = pd.io.sql.read_sql(
'''
SELECT id, size           --- here it only gets columns: id and size
    FROM properties       --- from a table, properties is a table 
    LIMIT 10              --- limit the size of data it shows
;
''', con = db)          # con means the connection

In [14]:
thing.head(5)

           id    size
0  2121978635   557.0
1    89239580  1050.0
2    15131782   937.0
3    15179502  1574.0
4    52266124  1205.0

In [15]:
thing = pd.io.sql.read_sql(
'''
SELECT id, size AS size_foo_bar                 --- you could rename the columns to your like
    FROM properties       --- from a table, properties is a table 
    LIMIT 10              --- limit the size of data it shows
;
''', con = db)          # con means the connection
thing       
# it is conventional that we put SQL statements in uppercase, and everything else in lowercase

           id  size_foo_bar
0  2121978635         557.0
1    89239580        1050.0
2    15131782         937.0
3    15179502        1574.0
4    52266124        1205.0
5  2100994004         400.0
6    15067755         541.0
7    15112556        1175.0
8    15133321        3094.0
9    61288341        1405.0

In [16]:
thing = pd.io.sql.read_sql(
'''
SELECT properties.id, properties.size AS size_foo_bar                ---specify which table to pull data
    FROM properties       --- from a table, properties is a table 
    LIMIT 10              --- limit the size of data it shows
;
''', con = db)          # con means the connection

### `SELECT`

In [22]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price, sale_price_unit
    FROM transactions
;
''', con = db)

            id  sale_price sale_price_unit
0     15165953   650000.00               $
1     80749447        1.15              $M
2     15155751   665000.00               $
3     15143887        2.10              $M
4     15117639        1.35              $M
..         ...         ...             ...
995   69819708   731000.00               $
996   15076156        5.53              $M
997  119685619   625000.00               $
998   15113584   895000.00               $
999   15068874   650000.00               $

[1000 rows x 3 columns]

### `WHERE`

In [20]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price
    FROM transactions
    WHERE sale_price_unit = '$M'      --- specify conditions for it 
;
''', con = db)

             id  sale_price
0      80749447        1.15
1      15143887        2.10
2      15117639        1.35
3      80743040        1.48
4      15134909        1.09
..          ...         ...
570  2101028916        2.45
571    15091950        1.75
572    89237766        1.16
573    15197693        1.36
574    15076156        5.53

[575 rows x 2 columns]

In [21]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price/1000000 as sale_price
    FROM transactions
    WHERE sale_price_unit = '$'      --- specify conditions for it 
;
''', con = db)

            id  sale_price
0     15165953       0.650
1     15155751       0.665
2    124852113       0.825
3     15124281       0.625
4     15071070       0.718
..         ...         ...
420  119685503       0.750
421   69819708       0.731
422  119685619       0.625
423   15113584       0.895
424   15068874       0.650

[425 rows x 2 columns]

> ### Here's let's convert the unit of `sale_price` from \$ to \$M

In [22]:
pd.io.sql.read_sql(
'''
SELECT id, sale_price / 1000000 AS sale_price
    FROM transactions
    WHERE sale_price_unit = '$'
;
''', con = db)

            id  sale_price
0     15165953       0.650
1     15155751       0.665
2    124852113       0.825
3     15124281       0.625
4     15071070       0.718
..         ...         ...
420  119685503       0.750
421   69819708       0.731
422  119685619       0.625
423   15113584       0.895
424   15068874       0.650

[425 rows x 2 columns]

### `UNION`

> ### Let's combine the previous two queries into one.  `sale_price` is now in \$M accross the dataset

In [25]:
pd.io.sql.read_sql('''
SELECT id, sale_price / 1000000 AS sale_price
    FROM transactions
    WHERE sale_price_unit = '$'
UNION ALL
SELECT id, sale_price
    FROM transactions
    WHERE sale_price_unit = '$M'
;
''', con = db)
# same thing we did in the last cell but in one single command

             id  sale_price
0      15165953       0.650
1      15155751       0.665
2     124852113       0.825
3      15124281       0.625
4      15071070       0.718
..          ...         ...
995  2101028916       2.450
996    15091950       1.750
997    89237766       1.160
998    15197693       1.360
999    15076156       5.530

[1000 rows x 2 columns]

### `WITH`

In [26]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M')
    
    --- with created a table in memory, not an actual table in the database
    
SELECT *
    FROM normalized_sale_prices
;
''', con = db)

             id  sale_price
0      15165953       0.650
1      15155751       0.665
2     124852113       0.825
3      15124281       0.625
4      15071070       0.718
..          ...         ...
995  2101028916       2.450
996    15091950       1.750
997    89237766       1.160
998    15197693       1.360
999    15076156       5.530

[1000 rows x 2 columns]

### `JOIN`

In [23]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M')

SELECT properties.baths AS baths, normalized_sale_prices.sale_price AS sale_price
    FROM properties
    JOIN normalized_sale_prices
        ON normalized_sale_prices.id = properties.id                 ---specify how it should be linked
;
''', con = db)



# difference between union and join 
# union is going to stack one on the other
# join is going to link the two together by the link you specify

     baths  sale_price
0      1.0       0.650
1      2.0       0.665
2      NaN       0.825
3      1.0       0.625
4      1.0       0.718
..     ...         ...
995    3.0       2.450
996    NaN       1.750
997    2.5       1.160
998    2.0       1.360
999    7.5       5.530

[1000 rows x 2 columns]

### `WITH` (take 2)

In [28]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

baths_normalized_sale_prices AS
    (SELECT properties.baths AS baths, normalized_sale_prices.sale_price AS sale_price
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT *
    FROM baths_normalized_sale_prices
;
''', con = db)

     baths  sale_price
0      1.0       0.650
1      2.0       0.665
2      NaN       0.825
3      1.0       0.625
4      1.0       0.718
..     ...         ...
995    3.0       2.450
996    NaN       1.750
997    2.5       1.160
998    2.0       1.360
999    7.5       5.530

[1000 rows x 2 columns]

### `GROUP BY` and `COUNT`

> ### Let's compute the number of properties based on their number of bedrooms

In [24]:
pd.io.sql.read_sql(
'''
SELECT COUNT() AS count
    FROM properties
    GROUP BY beds
;
''', con = db)

   count
0    164
1    142
2    316
3    226
4    103
5     28
6      9
7      6
8      3
9      3

### `GROUP BY` and `AVG`

> ### Let's now compute the average sale price of these properties based on their number of bathrooms

In [31]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

baths_normalized_sale_prices AS
    (SELECT properties.baths AS baths, normalized_sale_prices.sale_price AS sale_price
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT baths, AVG(sale_price) AS mean_sale_price
    FROM baths_normalized_sale_prices
    GROUP BY baths
;
''', con = db)

    baths  mean_sale_price
0     NaN         1.739026
1    1.00         0.987656
2    1.10         1.420000
3    1.25         1.600000
4    1.50         1.223378
..    ...              ...
16   6.50        16.000000
17   7.00         0.999000
18   7.50         5.530000
19   8.00        13.100000
20  14.00         1.000000

[21 rows x 2 columns]

Note: `baths = 0` usually refers to studios but not always...

> ### Activity
> #### Compute the average sales price of studios

In [34]:
pd.io.sql.read_sql(
'''
WITH normalized_sale_prices AS
    (SELECT id, sale_price / 1000000 AS sale_price
        FROM transactions
        WHERE sale_price_unit = '$'
    UNION ALL
    SELECT id, sale_price
        FROM transactions
        WHERE sale_price_unit = '$M'),

baths_normalized_sale_prices AS
    (SELECT properties.beds AS beds, normalized_sale_prices.sale_price AS sale_price
        FROM properties
        JOIN normalized_sale_prices
            ON normalized_sale_prices.id = properties.id)

SELECT beds, AVG(sale_price) AS mean_sale_price
    FROM baths_normalized_sale_prices
    WHERE beds = "1"
    GROUP BY beds
    
;
''', con = db)

   beds  mean_sale_price
0   1.0         0.820425

> ### Activity
> #### Find the properties in the dataset that have different addresses but the same latitude/longitude.  Return the smallest set of pair of properties (`address_a`, `address_b`)

In [95]:
pd.io.sql.read_sql(
'''

SELECT a.id AS id_a, b.id AS id_b, a.address AS address_a, b.address AS address_b
    FROM properties AS a
    JOIN properties AS b ON b.latitude = a.latitude AND b.longitude = a.longitude
    WHERE a.address < b.address
    ORDER BY address_a
;
''', con = db)

,id_a,id_b,address_a,address_b
0,15076699,15076711,"1 Daniel Burnham Ct APT 1202, San Francisco, CA","1 Daniel Burnham Ct APT 1404, San Francisco, CA"
1,15068857,15068874,"1001 Pine St APT 608, San Francisco, CA","1001 Pine St APT 801, San Francisco, CA"
2,15066036,15066001,"1070 Green St APT 1402, San Francisco, CA","1070 Green St APT 201, San Francisco, CA"
3,123174904,123174799,"1080 Sutter St APT 1001, San Francisco, CA","1080 Sutter St APT 1003, San Francisco, CA"
4,35972022,35972021,"1101 Pacific Ave APT 302, San Francisco, CA","1101 Pacific Ave, San Francisco, CA"
5,15064257,15064295,"111 Chestnut St APT 403, San Francisco, CA","111 Chestnut St APT 702, San Francisco, CA"
6,15068592,15068514,"1177 California St APT 304, San Francisco, CA","1177 California St APT 702, San Francisco, CA"
7,15068592,15068551,"1177 California St APT 304, San Francisco, CA","1177 California St APT 501, San Francisco, CA"
8,15068592,15068580,"1177 California St APT 304, San Francisco, CA","1177 California St APT 423, San Francisco, CA"
9,15068580,15068514,"1177 California St APT 423, San Francisco, CA","1177 California St APT 702, San Francisco, CA"
10,15068580,15068551,"1177 California St APT 423, San Francisco, CA","1177 California St APT 501, San Francisco, CA"
11,15068551,15068514,"1177 California St APT 501, San Francisco, CA","1177 California St APT 702, San Francisco, CA"
12,15067890,15067896,"1250 Jones St APT 503, San Francisco, CA","1250 Jones St APT 802, San Francisco, CA"
13,64969894,64969444,"140 S Van Ness Ave UNIT 1021, San Francisco, CA","140 S Van Ness Ave UNIT 619, San Francisco, CA"
14,64969894,64969822,"140 S Van Ness Ave UNIT 1021, San Francisco, CA","140 S Van Ness Ave UNIT 631, San Francisco, CA"
15,64969894,64969840,"140 S Van Ness Ave UNIT 1021, San Francisco, CA","140 S Van Ness Ave UNIT 746, San Francisco, CA"
16,64969444,64969822,"140 S Van Ness Ave UNIT 619, San Francisco, CA","140 S Van Ness Ave UNIT 631, San Francisco, CA"
17,64969444,64969840,"140 S Van Ness Ave UNIT 619, San Francisco, CA","140 S Van Ness Ave UNIT 746, San Francisco, CA"
18,64969822,64969840,"140 S Van Ness Ave UNIT 631, San Francisco, CA","140 S Van Ness Ave UNIT 746, San Francisco, CA"
19,80746693,80734665,"142 Russ St APT 4, San Francisco, CA","142 Russ St STE 5, San Francisco, CA"
20,15076294,15076310,"1450 Post St APT 1006, San Francisco, CA","1450 Post St APT 1108, San Francisco, CA"
21,2100831588,2100831587,"164 Parker Ave # A, San Francisco, CA","164 Parker Ave # B, San Francisco, CA"
22,54854510,54854511,"164A Parker Ave, San Francisco, CA","164B Parker Ave, San Francisco, CA"
23,119685526,119685188,"1902 Filbert St, San Francisco, CA","1902A Filbert St, San Francisco, CA"
24,80745091,80749447,"199 New Montgomery St UNIT 1009, San Francisco...","199 New Montgomery St UNIT 1201, San Francisco..."
25,80730989,80742238,"2002 3rd St APT 212, San Francisco, CA","2002 3rd St APT 213, San Francisco, CA"
26,111711144,111711124,"2125 Bryant St APT 118, San Francisco, CA","2125 Bryant St APT 5, San Francisco, CA"
27,2100786271,2100643449,"2149 Lyon St APT 1, San Francisco, CA","2149 Lyon St APT 4, San Francisco, CA"
28,52422775,58532731,"219 Brannan St UNIT 1B, San Francisco, CA","239 Brannan St UNIT 8C, San Francisco, CA"
29,124397860,124397844,"2200 Market St APT 202, San Francisco, CA","2200 Market St APT 205, San Francisco, CA"
30,64969751,64969930,"2412 Harrison St APT 104, San Francisco, CA","2412 Harrison St APT 109, San Francisco, CA"
31,69819469,69819412,"250 King St UNIT 1304, San Francisco, CA","250 King St UNIT 410, San Francisco, CA"
32,2101028916,15149005,"251 Missouri St, San Francisco, CA","251-253 Missouri St, San Francisco, CA"
33,69819664,69819845,"260 King St UNIT 1205, San Francisco, CA","260 King St UNIT 769, San Francisco, CA"
34,69819664,80730869,"260 King St UNIT 1205, San Francisco, CA","260 King St UNIT 817, San Francisco, CA"
35,69819664,80735046,"260 King St UNIT 1205, San Francisco, CA","260 King St UNIT 703, San Francisco, CA"
36,69819708,69819637,"260 King St UNIT 421, San Francisco, CA","260 King St UNIT 815, San Francisco, CA"
37,80735046,69819845,"260 King St UNIT 703, San Francisco, CA","260 King St UNIT 769, San Francisco, CA"
38,80735046,80730869,"260 King St UNIT 703, San Francisco, CA","260 King St UNIT 817, San Francisco, CA"
39,69819845,80730869,"260 King St UNIT 769, San Francisco, CA","260 King St UNIT 817, San Francisco, CA"
40,69820025,69820026,"270 Valencia St APT 503, San Francisco, CA","270 Valencia St APT 505, San Francisco, CA"
41,15071012,15071070,"2701 Van Ness Ave APT 207, San Francisco, CA","2701 Van Ness Ave APT 702, San Francisco, CA"
42,96018886,96043590,"300 Berry St UNIT 1212, San Francisco, CA","300 Berry St UNIT 720, San Francisco, CA"
43,15078423,15078419,"301 Gough St # G, San Francisco, CA","301 Gough St APT 3, San Francisco, CA"
44,89239104,89237721,"301 Main St # IT5C, San Francisco, CA","301 Main St # T28F, San Francisco, CA"
45,89239104,89240616,"301 Main St # IT5C, San Francisco, CA","301 Main St # T23C, San Francisco, CA"
46,89240616,89237721,"301 Main St # T23C, San Francisco, CA","301 Main St # T28F, San Francisco, CA"
47,64972578,64972688,"333 1st St PH 2103, San Francisco, CA","355 1st St UNIT 1602, San Francisco, CA"
48,64972578,2126960082,"333 1st St PH 2103, San Francisco, CA","355 1st St UNIT 1905, San Francisco, CA"
49,89239837,89238065,"338 Spear St UNIT 10B, San Francisco, CA","338 Spear St UNIT 5J, San Francisco, CA"
...,...,...,...,...
57,64972712,64972644,"355 1st St UNIT S1905, San Francisco, CA","355 1st St UNIT S909, San Francisco, CA"
58,63107226,67394898,"3981 Alemany Blvd APT 206, San Francisco, CA","8300 Oceanview Ter APT 306, San Francisco, CA"
59,63107226,67395015,"3981 Alemany Blvd APT 206, San Francisco, CA","8400 Oceanview Ter APT 218, San Francisco, CA"
60,61288494,61325457,"400 Alemany Blvd APT 12, San Francisco, CA","400 Alemany Blvd APT 15, San Francisco, CA"
61,80738981,67394276,"400 Beale St APT 1308, San Francisco, CA","400 Beale St APT 408, San Francisco, CA"
62,80738981,80742310,"400 Beale St APT 1308, San Francisco, CA","400 Beale St APT 1407, San Francisco, CA"
63,80738981,80746381,"400 Beale St APT 1308, San Francisco, CA","400 Beale St APT 2506, San Francisco, CA"
64,80742310,67394276,"400 Beale St APT 1407, San Francisco, CA","400 Beale St APT 408, San Francisco, CA"
65,80742310,80746381,"400 Beale St APT 1407, San Francisco, CA","400 Beale St APT 2506, San Francisco, CA"
66,80746381,67394276,"400 Beale St APT 2506, San Francisco, CA","400 Beale St APT 408, San Francisco, CA"
67,116155848,116089863,"435 China Basin St UNIT 439, San Francisco, CA","435 China Basin St UNIT 619, San Francisco, CA"
68,58883369,55004355,"445 Francisco St APT 304, San Francisco, CA","530 Chestnut St APT 407, San Francisco, CA"
69,15148102,15148103,"461 2nd St APT T354, San Francisco, CA","461 2nd St APT T355, San Francisco, CA"
70,115828655,115828679,"480 Mission Bay Blvd N UNIT 614, San Francisco...","480 Mission Bay Blvd N UNIT 809, San Francisco..."
71,64972330,64972332,"499 33rd Ave APT 101, San Francisco, CA","499 33rd Ave APT 103, San Francisco, CA"
72,64972330,64972340,"499 33rd Ave APT 101, San Francisco, CA","499 33rd Ave APT 305, San Francisco, CA"
73,64972330,64972342,"499 33rd Ave APT 101, San Francisco, CA","499 33rd Ave APT 310, San Francisco, CA"
74,64972332,64972340,"499 33rd Ave APT 103, San Francisco, CA","499 33rd Ave APT 305, San Francisco, CA"
75,64972332,64972342,"499 33rd Ave APT 103, San Francisco, CA","499 33rd Ave APT 310, San Francisco, CA"
76,64972340,64972342,"499 33rd Ave APT 305, San Francisco, CA","499 33rd Ave APT 310, San Francisco, CA"
77,2100695464,15085696,"532 Lyon St, San Francisco, CA","532-534 Lyon St, San Francisco, CA"
78,79846666,79844263,"555 4th St UNIT 513, San Francisco, CA","555 4th St, San Francisco, CA"
79,119685556,119684869,"5800 3rd St UNIT 1401, San Francisco, CA","5900 3rd St UNIT 2219, San Francisco, CA"
80,89238591,89240438,"6 Mint Plz APT 601A, San Francisco, CA","6 Mint Plz APT 702A, San Francisco, CA"
81,15077725,15077572,"601 Van Ness Ave APT 201, San Francisco, CA","601 Van Ness Ave APT 48, San Francisco, CA"
82,15077725,15077602,"601 Van Ness Ave APT 201, San Francisco, CA","601 Van Ness Ave APT 78, San Francisco, CA"
83,15077725,15077705,"601 Van Ness Ave APT 201, San Francisco, CA","601 Van Ness Ave APT 605, San Francisco, CA"
84,15077725,15077902,"601 Van Ness Ave APT 201, San Francisco, CA","601 Van Ness Ave APT 944, San Francisco, CA"
85,15077725,15077929,"601 Van Ness Ave APT 201, San Francisco, CA","601 Van Ness Ave APT 405, San Francisco, CA"
86,15077929,15077572,"601 Van Ness Ave APT 405, San Francisco, CA","601 Van Ness Ave APT 48, San Francisco, CA"
87,15077929,15077602,"601 Van Ness Ave APT 405, San Francisco, CA","601 Van Ness Ave APT 78, San Francisco, CA"
88,15077929,15077705,"601 Van Ness Ave APT 405, San Francisco, CA","601 Van Ness Ave APT 605, San Francisco, CA"
89,15077929,15077902,"601 Van Ness Ave APT 405, San Francisco, CA","601 Van Ness Ave APT 944, San Francisco, CA"
90,15077572,15077602,"601 Van Ness Ave APT 48, San Francisco, CA","601 Van Ness Ave APT 78, San Francisco, CA"
91,15077572,15077705,"601 Van Ness Ave APT 48, San Francisco, CA","601 Van Ness Ave APT 605, San Francisco, CA"
92,15077572,15077902,"601 Van Ness Ave APT 48, San Francisco, CA","601 Van Ness Ave APT 944, San Francisco, CA"
93,15077705,15077602,"601 Van Ness Ave APT 605, San Francisco, CA","601 Van Ness Ave APT 78, San Francisco, CA"
94,15077705,15077902,"601 Van Ness Ave APT 605, San Francisco, CA","601 Van Ness Ave APT 944, San Francisco, CA"
95,15077602,15077902,"601 Van Ness Ave APT 78, San Francisco, CA","601 Van Ness Ave APT 944, San Francisco, CA"
96,80738064,59779827,"761 Tehama St APT 1, San Francisco, CA","761 Tehama St APT 13, San Francisco, CA"
97,63197318,63197354,"765 Market St APT 27B, San Francisco, CA","765 Market St APT 31H, San Francisco, CA"
98,69817953,69817944,"767 Bryant St APT 402, San Francisco, CA","767 Bryant St, San Francisco, CA"
99,60825591,61288454,"77 Dow Pl APT 500, San Francisco, CA","77 Dow Pl APT 507, San Francisco, CA"
100,124850278,124862135,"8 Octavia St UNIT 401, San Francisco, CA","8 Octavia St, San Francisco, CA"
101,119685503,123597964,"829 Folsom St UNIT 412, San Francisco, CA","829 Folsom St UNIT 906, San Francisco, CA"
102,67394898,67395015,"8300 Oceanview Ter APT 306, San Francisco, CA","8400 Oceanview Ter APT 218, San Francisco, CA"
103,111931130,111930969,"860 Waller St APT 1, San Francisco, CA","860 Waller St APT 2, San Francisco, CA"
104,52266124,53153575,"88 King St APT 317, San Francisco, CA","88 King St APT 419, San Francisco, CA"
105,89239862,89228573,"901 Bush St APT 203, San Francisco, CA","901 Bush St APT 307, San Francisco, CA"
106,15067583,15067604,"946 Stockton St APT 6B, San Francisco, CA","946 Stockton St APT 9E, San Francisco, CA"

In [103]:
thing = pd.io.sql.read_sql(
'''

SELECT (latitude || ' ' || longitude) AS location, address
    FROM properties
    ---GROUP BY location
    ---HAVING COUNT(location)>1
    ORDER BY address
;
''', con = db)

In [105]:
#thing1[thing1.address[0:3] == '88 ']
pd.set_option('display.max_rows', 100)
#DataFrame.duplicated(subset=None, keep='first')
thing[thing.duplicated(subset = 'location', keep = False)]

                location                                            address
1    37786755 -122422500    1 Daniel Burnham Ct APT 1202, San Francisco, CA
2    37786755 -122422500    1 Daniel Burnham Ct APT 1404, San Francisco, CA
9    37790348 -122412568            1001 Pine St APT 608, San Francisco, CA
10   37790348 -122412568            1001 Pine St APT 801, San Francisco, CA
32   37798792 -122416797          1070 Green St APT 1402, San Francisco, CA
33   37798792 -122416797           1070 Green St APT 201, San Francisco, CA
35   37788066 -122418065         1080 Sutter St APT 1001, San Francisco, CA
36   37788066 -122418065         1080 Sutter St APT 1003, San Francisco, CA
43   37795912 -122413603        1101 Pacific Ave APT 302, San Francisco, CA
44   37795912 -122413603                1101 Pacific Ave, San Francisco, CA
45   37804240 -122405509         111 Chestnut St APT 403, San Francisco, CA
46   37804240 -122405509         111 Chestnut St APT 702, San Francisco, CA
63   37791089 -122413658      1177 California St APT 304, San Francisco, CA
64   37791089 -122413658      1177 California St APT 423, San Francisco, CA
65   37791089 -122413658      1177 California St APT 501, San Francisco, CA
66   37791089 -122413658      1177 California St APT 702, San Francisco, CA
88   37793071 -122414049           1250 Jones St APT 503, San Francisco, CA
89   37793071 -122414049           1250 Jones St APT 802, San Francisco, CA
157  37771585 -122418825    140 S Van Ness Ave UNIT 1021, San Francisco, CA
158  37771585 -122418825     140 S Van Ness Ave UNIT 619, San Francisco, CA
159  37771585 -122418825     140 S Van Ness Ave UNIT 631, San Francisco, CA
160  37771585 -122418825     140 S Van Ness Ave UNIT 746, San Francisco, CA
164  37778152 -122407806               142 Russ St APT 4, San Francisco, CA
165  37778152 -122407806               142 Russ St STE 5, San Francisco, CA
173  37786361 -122425831           1450 Post St APT 1006, San Francisco, CA
174  37786361 -122425831           1450 Post St APT 1108, San Francisco, CA
243  37782512 -122454025              164 Parker Ave # A, San Francisco, CA
244  37782512 -122454025              164 Parker Ave # B, San Francisco, CA
246  37782514 -122454028                 164A Parker Ave, San Francisco, CA
247  37782514 -122454028                 164B Parker Ave, San Francisco, CA
312  37798831 -122431053                 1902 Filbert St, San Francisco, CA
313  37798831 -122431053                1902A Filbert St, San Francisco, CA
316  37742141 -122435111                 1915 Diamond St, San Francisco, CA
317  37742141 -122435111                 1915 Diamond St, San Francisco, CA
331  37786632 -122399101  199 New Montgomery St UNIT 1009, San Francisco...
332  37786632 -122399101  199 New Montgomery St UNIT 1201, San Francisco...
341  37763988 -122389167             2002 3rd St APT 212, San Francisco, CA
342  37763988 -122389167             2002 3rd St APT 213, San Francisco, CA
364  37760113 -122409928          2125 Bryant St APT 118, San Francisco, CA
365  37760113 -122409928            2125 Bryant St APT 5, San Francisco, CA
369  37790535 -122446099              2149 Lyon St APT 1, San Francisco, CA
370  37790535 -122446099              2149 Lyon St APT 4, San Francisco, CA
375  37782575 -122390364          219 Brannan St UNIT 1B, San Francisco, CA
380  37765724 -122431383          2200 Market St APT 202, San Francisco, CA
381  37765724 -122431383          2200 Market St APT 205, San Francisco, CA
417  37782575 -122390364          239 Brannan St UNIT 8C, San Francisco, CA
420  37758487 -122412814        2412 Harrison St APT 104, San Francisco, CA
421  37758487 -122412814        2412 Harrison St APT 109, San Francisco, CA
431  37777645 -122393430           250 King St UNIT 1304, San Francisco, CA
432  37777645 -122393430            250 King St UNIT 410, San Francisco, CA
..                   ...                                                ...
663  37786910 -122390925           400 Beale St APT 2506, San Francisco, CA
664  37786910 -122390925            400 Beale St APT 408, San Francisco, CA
698  37771587 -122388458     435 China Basin St UNIT 439, San Francisco, CA
699  37771587 -122388458     435 China Basin St UNIT 619, San Francisco, CA
707  37804334 -122412450        445 Francisco St APT 304, San Francisco, CA
723  37783699 -122393590             461 2nd St APT T354, San Francisco, CA
724  37783699 -122393590             461 2nd St APT T355, San Francisco, CA
734  37771155 -122389034  480 Mission Bay Blvd N UNIT 614, San Francisco...
735  37771155 -122389034  480 Mission Bay Blvd N UNIT 809, San Francisco...
741  37779990 -122493690            499 33rd Ave APT 101, San Francisco, CA
742  37779990 -122493690            499 33rd Ave APT 103, San Francisco, CA
743  37779990 -122493690            499 33rd Ave APT 305, San Francisco, CA
744  37779990 -122493690            499 33rd Ave APT 310, San Francisco, CA
765  37804334 -122412450         530 Chestnut St APT 407, San Francisco, CA
766  37775802 -122442710                     532 Lyon St, San Francisco, CA
767  37775802 -122442710                 532-534 Lyon St, San Francisco, CA
790  37779422 -122396712             555 4th St UNIT 513, San Francisco, CA
792  37779422 -122396712                      555 4th St, San Francisco, CA
807  37725337 -122399307           5800 3rd St UNIT 1401, San Francisco, CA
815  37725337 -122399307           5900 3rd St UNIT 2219, San Francisco, CA
820  37783080 -122407541             6 Mint Plz APT 601A, San Francisco, CA
821  37783080 -122407541             6 Mint Plz APT 702A, San Francisco, CA
825  37781386 -122421406        601 Van Ness Ave APT 201, San Francisco, CA
826  37781386 -122421406        601 Van Ness Ave APT 405, San Francisco, CA
827  37781386 -122421406         601 Van Ness Ave APT 48, San Francisco, CA
828  37781386 -122421406        601 Van Ness Ave APT 605, San Francisco, CA
829  37781386 -122421406         601 Van Ness Ave APT 78, San Francisco, CA
830  37781386 -122421406        601 Van Ness Ave APT 944, San Francisco, CA
911  37775009 -122411787             761 Tehama St APT 1, San Francisco, CA
912  37775009 -122411787            761 Tehama St APT 13, San Francisco, CA
913  37786220 -122404310           765 Market St APT 27B, San Francisco, CA
914  37786220 -122404310           765 Market St APT 31H, San Francisco, CA
915  37776359 -122401564           767 Bryant St APT 402, San Francisco, CA
917  37776359 -122401564                   767 Bryant St, San Francisco, CA
920  37784195 -122396605               77 Dow Pl APT 500, San Francisco, CA
921  37784195 -122396605               77 Dow Pl APT 507, San Francisco, CA
929  37772548 -122423362           8 Octavia St UNIT 401, San Francisco, CA
930  37772548 -122423362                    8 Octavia St, San Francisco, CA
946  37781154 -122401649          829 Folsom St UNIT 412, San Francisco, CA
948  37781154 -122401649          829 Folsom St UNIT 906, San Francisco, CA
952  37710480 -122467645      8300 Oceanview Ter APT 306, San Francisco, CA
953  37710480 -122467645      8400 Oceanview Ter APT 218, San Francisco, CA
957  37770488 -122437927             860 Waller St APT 1, San Francisco, CA
958  37770488 -122437927             860 Waller St APT 2, San Francisco, CA
961  37780630 -122389635              88 King St APT 317, San Francisco, CA
962  37780630 -122389635              88 King St APT 419, San Francisco, CA
970  37789520 -122412277             901 Bush St APT 203, San Francisco, CA
971  37789520 -122412277             901 Bush St APT 307, San Francisco, CA
977  37794715 -122407810          946 Stockton St APT 6B, San Francisco, CA
978  37794715 -122407810          946 Stockton St APT 9E, San Francisco, CA

[135 rows x 2 columns]